package icu.hearme.vrain.configure

private val zhPageNumMap = mapOf(
    0 to "〇", 1 to "一", 2 to "二", 3 to "三", 4 to "四", 5 to "五", 6 to "六", 7 to "七", 8 to "八", 9 to "九",
    10 to "十", 11 to "十一", 12 to "十二", 13 to "十三", 14 to "十四", 15 to "十五", 16 to "十六", 17 to "十七", 18 to "十八", 19 to "十九",
    20 to "二十", 21 to "二十一", 22 to "二十二", 23 to "二十三", 24 to "二十四", 25 to "二十五", 26 to "二十六", 27 to "二十七", 28 to "二十八", 29 to "二十九",
    30 to "三十", 31 to "三十一", 32 to "三十二", 33 to "三十三", 34 to "三十四", 35 to "三十五", 36 to "三十六", 37 to "三十七", 38 to "三十八", 39 to "三十九",
    40 to "四十", 41 to "四十一", 42 to "四十二", 43 to "四十三", 44 to "四十四", 45 to "四十五", 46 to "四十六", 47 to "四十七", 48 to "四十八", 49 to "四十九",
    50 to "五十", 51 to "五十一", 52 to "五十二", 53 to "五十三", 54 to "五十四", 55 to "五十五", 56 to "五十六", 57 to "五十七", 58 to "五十八", 59 to "五十九",
    60 to "六十", 61 to "六十一", 62 to "六十二", 63 to "六十三", 64 to "六十四", 65 to "六十五", 66 to "六十六", 67 to "六十七", 68 to "六十八", 69 to "六十九",
    70 to "七十", 71 to "七十一", 72 to "七十二", 73 to "七十三", 74 to "七十四", 75 to "七十五", 76 to "七十六", 77 to "七十七", 78 to "七十八", 79 to "七十九",
    80 to "八十", 81 to "八十一", 82 to "八十二", 83 to "八十三", 84 to "八十四", 85 to "八十五", 86 to "八十六", 87 to "八十七", 88 to "八十八", 89 to "八十九",
    90 to "九十", 91 to "九十一", 92 to "九十二", 93 to "九十三", 94 to "九十四", 95 to "九十五", 96 to "九十六", 97 to "九十七", 98 to "九十八", 99 to "九十九",
    100 to "一百", 101 to "百一", 102 to "百二", 103 to "百三", 104 to "百四", 105 to "百五", 106 to "百六", 107 to "百七", 108 to "百八", 109 to "百九",
    110 to "百十", 111 to "百十一", 112 to "百十二", 113 to "百十三", 114 to "百十四", 115 to "百十五", 116 to "百十六", 117 to "百十七", 118 to "百十八", 119 to "百十九",
    120 to "百二十", 121 to "百二一", 122 to "百二二", 123 to "百二三", 124 to "百二四", 125 to "百二五", 126 to "百二六", 127 to "百二七", 128 to "百二八", 129 to "百二九",
    130 to "百三十", 131 to "百三一", 132 to "百三二", 133 to "百三三", 134 to "百三四", 135 to "百三五", 136 to "百三六", 137 to "百三七", 138 to "百三八", 139 to "百三九",
    140 to "百四十", 141 to "百四一", 142 to "百四二", 143 to "百四三", 144 to "百四四", 145 to "百四五", 146 to "百四六", 147 to "百四七", 148 to "百四八", 149 to "百四九",
    150 to "百五十", 151 to "百五一", 152 to "百五二", 153 to "百五三", 154 to "百五四", 155 to "百五五", 156 to "百五六", 157 to "百五七", 158 to "百五八", 159 to "百五九",
    160 to "百六十", 161 to "百六一", 162 to "百六二", 163 to "百六三", 164 to "百六四", 165 to "百六五", 166 to "百六六", 167 to "百六七", 168 to "百六八", 169 to "百六九",
    170 to "百七十", 171 to "百七一", 172 to "百七二", 173 to "百七三", 174 to "百七四", 175 to "百七五", 176 to "百七六", 177 to "百七七", 178 to "百七八", 179 to "百七九",
    180 to "百八十", 181 to "百八一", 182 to "百八二", 183 to "百八三", 184 to "百八四", 185 to "百八五", 186 to "百八六", 187 to "百八七", 188 to "百八八", 189 to "百八九",
    190 to "百九十", 191 to "百九一", 192 to "百九二", 193 to "百九三", 194 to "百九四", 195 to "百九五", 196 to "百九六", 197 to "百九七", 198 to "百九八", 199 to "百九九",
    200 to "二百", 201 to "二百一", 202 to "二百二", 203 to "二百三", 204 to "二百四", 205 to "二百五", 206 to "二百六", 207 to "二百七", 208 to "二百八", 209 to "二百九",
    210 to "二百十", 211 to "二百十一", 212 to "二百十二", 213 to "二百十三", 214 to "二百十四", 215 to "二百十五", 216 to "二百十六", 217 to "二百十七", 218 to "二百十八", 219 to "二百十九",
    220 to "二百二十", 221 to "二百二一", 222 to "二百二二", 223 to "二百二三", 224 to "二百二四", 225 to "二百二五", 226 to "二百二六", 227 to "二百二七", 228 to "二百二八", 229 to "二百二九",
    230 to "二百三十", 231 to "二百三一", 232 to "二百三二", 233 to "二百三三", 234 to "二百三四", 235 to "二百三五", 236 to "二百三六", 237 to "二百三七", 238 to "二百三八", 239 to "二百三九",
    240 to "二百四十", 241 to "二百四一", 242 to "二百四二", 243 to "二百四三", 244 to "二百四四", 245 to "二百四五", 246 to "二百四六", 247 to "二百四七", 248 to "二百四八", 249 to "二百四九",
    250 to "二百五十", 251 to "二百五一", 252 to "二百五二", 253 to "二百五三", 254 to "二百五四", 255 to "二百五五", 256 to "二百五六", 257 to "二百五七", 258 to "二百五八", 259 to "二百五九",
    260 to "二百六十", 261 to "二百六一", 262 to "二百六二", 263 to "二百六三", 264 to "二百六四", 265 to "二百六五", 266 to "二百六六", 267 to "二百六七", 268 to "二百六八", 269 to "二百六九",
    270 to "二百七十", 271 to "二百七一", 272 to "二百七二", 273 to "二百七三", 274 to "二百七四", 275 to "二百七五", 276 to "二百七六", 277 to "二百七七", 278 to "二百七八", 279 to "二百七九",
    280 to "二百八十", 281 to "二百八一", 282 to "二百八二", 283 to "二百八三", 284 to "二百八四", 285 to "二百八五", 286 to "二百八六", 287 to "二百八七", 288 to "二百八八", 289 to "二百八九",
    290 to "二百九十", 291 to "二百九一", 292 to "二百九二", 293 to "二百九三", 294 to "二百九四", 295 to "二百九五", 296 to "二百九六", 297 to "二百九七", 298 to "二百九八", 299 to "二百九九",
    300 to "三百", 301 to "三百一", 302 to "三百二", 303 to "三百三", 304 to "三百四", 305 to "三百五", 306 to "三百六", 307 to "三百七", 308 to "三百八", 309 to "三百九",
    310 to "三百十", 311 to "三百十一", 312 to "三百十二", 313 to "三百十三", 314 to "三百十四", 315 to "三百十五", 316 to "三百十六", 317 to "三百十七", 318 to "三百十八", 319 to "三百十九",
    320 to "三百二十", 321 to "三百二一", 322 to "三百二二", 323 to "三百二三", 324 to "三百二四", 325 to "三百二五", 326 to "三百二六", 327 to "三百二七", 328 to "三百二八", 329 to "三百二九",
    330 to "三百三十", 331 to "三百三一", 332 to "三百三二", 333 to "三百三三", 334 to "三百三四", 335 to "三百三五", 336 to "三百三六", 337 to "三百三七", 338 to "三百三八", 339 to "三百三九",
    340 to "三百四十", 341 to "三百四一", 342 to "三百四二", 343 to "三百四三", 344 to "三百四四", 345 to "三百四五", 346 to "三百四六", 347 to "三百四七", 348 to "三百四八", 349 to "三百四九",
    350 to "三百五十", 351 to "三百五一", 352 to "三百五二", 353 to "三百五三", 354 to "三百五四", 355 to "三百五五", 356 to "三百五六", 357 to "三百五七", 358 to "三百五八", 359 to "三百五九",
    360 to "三百六十", 361 to "三百六一", 362 to "三百六二", 363 to "三百六三", 364 to "三百六四", 365 to "三百六五", 366 to "三百六六", 367 to "三百六七", 368 to "三百六八", 369 to "三百六九",
    370 to "三百七十", 371 to "三百七一", 372 to "三百七二", 373 to "三百七三", 374 to "三百七四", 375 to "三百七五", 376 to "三百七六", 377 to "三百七七", 378 to "三百七八", 379 to "三百七九",
    380 to "三百八十", 381 to "三百八一", 382 to "三百八二", 383 to "三百八三", 384 to "三百八四", 385 to "三百八五", 386 to "三百八六", 387 to "三百八七", 388 to "三百八八", 389 to "三百八九",
    390 to "三百九十", 391 to "三百九一", 392 to "三百九二", 393 to "三百九三", 394 to "三百九四", 395 to "三百九五", 396 to "三百九六", 397 to "三百九七", 398 to "三百九八", 399 to "三百九九",
    400 to "四百"
)

fun getZhPageNum(num: Int): String {
    return zhPageNumMap[num] ?: num.toString()
}